#ifndef PXMIPSINCLUDE
#define PXMIPSINCLUDE

#include "../PXResource.h"

#define PXMIPSOPCodeNormal  0b00000000 
#define PXMIPSOPCodeSpecial 0b01000000 
#define PXMIPSOPCodeREGIMM  0b10000000 
#define PXMIPSOPCodeCOPz    0b11000000 

typedef enum PXMIPSInstructionType_
{
    PXMIPSInstructionTypeInvalid = 99999,

    //----------------------------------------------------------------------------
    // General instructions
    //----------------------------------------------------------------------------
    PXMIPSInstructionTypeOPCodeSpecial                      = 0b000000,
    PXMIPSInstructionTypeOPCodeREGIMM                       = 0b000001,
    PXMIPSInstructionTypeJump                               = 0b000010, // J
    PXMIPSInstructionTypeJumpAndLink                        = 0b000011, // JAL
    PXMIPSInstructionTypeBranchOnEqual                      = 0b000100, // BEQ
    PXMIPSInstructionTypeBranchOnNotEqual                   = 0b000101, // BNE
    PXMIPSInstructionTypeBranchOnLessThanOrEqualToZero      = 0b000110, // BLEZ
    PXMIPSInstructionTypeBranchOnGreaterThanZero            = 0b000111, // BGTZ
    PXMIPSInstructionTypeADDImmediate                       = 0b001000, // ADDI
    PXMIPSInstructionTypeADDImmediateUnsigned               = 0b001001, // ADDIU
    PXMIPSInstructionTypeSetOnLessThanImmediate             = 0b001010, // SLTI
    PXMIPSInstructionTypeSetOnLessThanImmediateUnsigned     = 0b001011, // SLTIU 

    PXMIPSInstructionTypeTrapIfNotEqualImmediate                         = 0b01110 | PXMIPSOPCodeREGIMM, // TNEI
    // Reserved = xxxxx, // ???
    PXMIPSInstructionTypeBranchOnLessThanZeroAndLink                     = 0b10000 | PXMIPSOPCodeREGIMM, // BLTZAL
    PXMIPSInstructionTypeBranchOnGreaterThanOrEqualToZeroAndLink         = 0b10001 | PXMIPSOPCodeREGIMM, // BGEZAL
    PXMIPSInstructionTypeBranchOnLessThanZeroAndLinkLikely               = 0b10010 | PXMIPSOPCodeREGIMM, // BLTZALL
    PXMIPSInstructionTypeBranchOnGreaterThanOrEqualToZeroAndLinkLikely   = 0b10011 | PXMIPSOPCodeREGIMM, // BGEZALL
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    //----------------------------------------------------------------------------


    //----------------------------------------------------------------------------
    // COPz rs
    //----------------------------------------------------------------------------
    PXMIPSInstructionTypeMoveWordFromFPUCoprocessor1                = 0b00000 | PXMIPSOPCodeCOPz, // MF
    PXMIPSInstructionTypeDoublewordMoveFromSystemControlCoprocessor = 0b00001 | PXMIPSOPCodeCOPz, // DMFC0
    PXMIPSInstructionTypeMoveControlWordFromCoprocessorZ            = 0b00010 | PXMIPSOPCodeCOPz, // CFCz - FPU
    // Reserved = xxxxx, // ???
    PXMIPSInstructionTypeMoveToSystemControlCoprocessor             = 0b00100 | PXMIPSOPCodeCOPz, // MT / MTC0
    PXMIPSInstructionTypeDoublewordMoveToSystemControlCoprocessor   = 0b00101 | PXMIPSOPCodeCOPz, // DMTC0
    PXMIPSInstructionTypeMoveControlToCoprocessorZ                  = 0b00110 | PXMIPSOPCodeCOPz, // CTCz
    // = 0b00111 // Reserved = xxxxx, // ???
    // = 0b01000 // BC
    //----------------------------------------------------------------------------



    //----------------------------------------------------------------------------
    // BC - COPz rt - Only for CoProcessor 1
    //----------------------------------------------------------------------------
    BranchOnFPUFalse        = 0b00000, // BCF
    BranchOnFPUFalseLikely  = 0b00010, // BCT
    BranchOnFPUTrue         = 0b00001, // BCFL
    BranchOnFPUTrueLikely   = 0b00011, // BCTL
    //----------------------------------------------------------------------------



    //----------------------------------------------------------------------------
    // CP0 Function
    //----------------------------------------------------------------------------
    // ---
    // TLBR
    // TLBWI
    // ----
    // ----
    // ----
    // TLBWR
    // ----
    // TLBP
    //----------------------------------------------------------------------------
}
PXMIPSInstructionType;


#define PXMIPSProcessorLinkAddress 31

#define PXMIPSRegisterStatusFR 0b0001 // ???

#define PXMIPSRegisterFT 2


typedef struct PXMIPSRegister_
{
    PXSize Index; // 0
    PXSize Random; // 1
    PXSize EntryLo0; // 2
    PXSize EntryLo1; // 3
    PXSize Context; // 4
    PXSize PageMask; // 5
    PXSize Wired; // 6
    PXSize UnusedA; // 7 - unused
    PXSize BadVAddr; // 8
    PXSize Count; // 9
    PXSize EntryHi; // 10
    PXSize Compare; // 11
    PXSize Status; // 12
    PXSize Cause; // 13
    PXSize EPC; // 14
    PXSize PRId; // 15
    PXSize Config; // 16
    PXSize LLAddr; // 17
    PXSize WatchLo; // 18
    PXSize WatchHi; // 19
    PXSize XContext; // 20
    PXSize UnusedB; // 21
    PXSize UnusedC; // 22
    PXSize UnusedD; // 23
    PXSize UnusedE; // 24
    PXSize UnusedF; // 25
    PXSize ParityError; // 26
    PXSize CacheError; // 27
    PXSize TagLo; // 28
    PXSize TagHi; // 29
    PXSize ErrorEPC; // 30
    PXSize UnusedG; // 31
}
PXMIPSRegister;

typedef void (PXAPI* PXMIPSTInstructionFunction)(struct PXMIPSProcessor_* const pxMIPSProcessor, struct PXMIPSTInstruction_* const pxMIPSTInstruction);


typedef struct PXMIPSCoProcessor_
{

    PXSize RegisterList[32];
    PXBool Enabled;
}
PXMIPSCoProcessor;

typedef struct PXMIPSProcessor_
{
    PXMIPSTInstructionFunction* GeneralInstructionList;
    PXMIPSTInstructionFunction* SpecialInstructionList;
    PXMIPSTInstructionFunction* REGIMMInstructionList;
    PXMIPSTInstructionFunction* CorpocessorList;

    void* ROMOffsetVirtual;
    void* ROMOffsetActual;
    PXSize ROMOffsetCurrent;
    PXSize ROMOffsetMaximal;

    void* RAMAdressVirtual;
    void* RAMAdress;
    PXSize RAMSize;

    PXSize ProgramCounter;
    PXSize RegisterStatus;

    float RegisterFloat[32];

    union
    {
        PXSize RegisterList[32]; // GPRs general purpose registers (should be 32)
        PXMIPSRegister Register;
    };

