#pragma once

#ifndef PXMIPSIncluded
#define PXMIPSIncluded

#include <PX/Media/PXType.h>
#include <PX/OS/Error/PXResult.h>

#define PXMIPSOPCodeNormal  0b00000000
#define PXMIPSOPCodeSpecial 0b01000000
#define PXMIPSOPCodeREGIMM  0b10000000
#define PXMIPSOPCodeCOPz    0b11000000

typedef enum PXMIPSInstructionType_
{
    PXMIPSInstructionTypeInvalid = 99999,

    //----------------------------------------------------------------------------
    // General instructions
    //----------------------------------------------------------------------------
    PXMIPSInstructionTypeOPCodeSpecial                      = 0b000000,
    PXMIPSInstructionTypeOPCodeREGIMM                       = 0b000001,
    PXMIPSInstructionTypeJump                               = 0b000010, // J
    PXMIPSInstructionTypeJumpAndLink                        = 0b000011, // JAL
    PXMIPSInstructionTypeBranchOnEqual                      = 0b000100, // BEQ
    PXMIPSInstructionTypeBranchOnNotEqual                   = 0b000101, // BNE
    PXMIPSInstructionTypeBranchOnLessThanOrEqualToZero      = 0b000110, // BLEZ
    PXMIPSInstructionTypeBranchOnGreaterThanZero            = 0b000111, // BGTZ
    PXMIPSInstructionTypeADDImmediate                       = 0b001000, // ADDI
    PXMIPSInstructionTypeADDImmediateUnsigned               = 0b001001, // ADDIU
    PXMIPSInstructionTypeSetOnLessThanImmediate             = 0b001010, // SLTI
    PXMIPSInstructionTypeSetOnLessThanImmediateUnsigned     = 0b001011, // SLTIU

    PXMIPSInstructionTypeTrapIfNotEqualImmediate                         = 0b01110 | PXMIPSOPCodeREGIMM, // TNEI
    // Reserved = xxxxx, // ???
    PXMIPSInstructionTypeBranchOnLessThanZeroAndLink                     = 0b10000 | PXMIPSOPCodeREGIMM, // BLTZAL
    PXMIPSInstructionTypeBranchOnGreaterThanOrEqualToZeroAndLink         = 0b10001 | PXMIPSOPCodeREGIMM, // BGEZAL
    PXMIPSInstructionTypeBranchOnLessThanZeroAndLinkLikely               = 0b10010 | PXMIPSOPCodeREGIMM, // BLTZALL
    PXMIPSInstructionTypeBranchOnGreaterThanOrEqualToZeroAndLinkLikely   = 0b10011 | PXMIPSOPCodeREGIMM, // BGEZALL
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    // Reserved = xxxxx, // ???
    //----------------------------------------------------------------------------


    //----------------------------------------------------------------------------
    // COPz rs
    //----------------------------------------------------------------------------
    PXMIPSInstructionTypeMoveWordFromFPUCoprocessor1                = 0b00000 | PXMIPSOPCodeCOPz, // MF
    PXMIPSInstructionTypeDoublewordMoveFromSystemControlCoprocessor = 0b00001 | PXMIPSOPCodeCOPz, // DMFC0
    PXMIPSInstructionTypeMoveControlWordFromCoprocessorZ            = 0b00010 | PXMIPSOPCodeCOPz, // CFCz - FPU
    // Reserved = xxxxx, // ???
    PXMIPSInstructionTypeMoveToSystemControlCoprocessor             = 0b00100 | PXMIPSOPCodeCOPz, // MT / MTC0
    PXMIPSInstructionTypeDoublewordMoveToSystemControlCoprocessor   = 0b00101 | PXMIPSOPCodeCOPz, // DMTC0
    PXMIPSInstructionTypeMoveControlToCoprocessorZ                  = 0b00110 | PXMIPSOPCodeCOPz, // CTCz
    // = 0b00111 // Reserved = xxxxx, // ???
    // = 0b01000 // BC
    //----------------------------------------------------------------------------



    //----------------------------------------------------------------------------
    // BC - COPz rt - Only for CoProcessor 1
    //----------------------------------------------------------------------------
    BranchOnFPUFalse        = 0b00000, // BCF
    BranchOnFPUFalseLikely  = 0b00010, // BCT
    BranchOnFPUTrue         = 0b00001, // BCFL
    BranchOnFPUTrueLikely   = 0b00011, // BCTL
    //----------------------------------------------------------------------------



    //----------------------------------------------------------------------------
    // CP0 Function
    //----------------------------------------------------------------------------
    // ---
    // TLBR
    // TLBWI
    // ----
    // ----
    // ----
    // TLBWR
    // ----
    // TLBP
    //----------------------------------------------------------------------------
}
PXMIPSInstructionType;


#define PXMIPSProcessorLinkAddress 31

#define PXMIPSRegisterStatusFR 0b0001 // ???

#define PXMIPSRegisterFT 2


typedef struct PXMIPSRegister_
{
    PXSize PXMIPSRegisterIndex; // 0
    PXSize PXMIPSRegisterRandom; // 1
    PXSize PXMIPSRegisterEntryLo0; // 2
    PXSize PXMIPSRegisterEntryLo1; // 3
    PXSize PXMIPSRegisterContext; // 4
    PXSize PXMIPSRegisterPageMask; // 5
    PXSize PXMIPSRegisterWired; // 6
    PXSize PXMIPSRegisterUnusedA; // 7 - unused
    PXSize PXMIPSRegisterBadVAddr; // 8
    PXSize PXMIPSRegisterCount; // 9
    PXSize PXMIPSRegisterEntryHi; // 10
    PXSize PXMIPSRegisterCompare; // 11
    PXSize PXMIPSRegisterStatus; // 12
    PXSize PXMIPSRegisterCause; // 13
    PXSize PXMIPSRegisterEPC; // 14
    PXSize PXMIPSRegisterPRId; // 15
    PXSize PXMIPSRegisterConfig; // 16
    PXSize PXMIPSRegisterLLAddr; // 17
    PXSize PXMIPSRegisterWatchLo; // 18
    PXSize PXMIPSRegisterWatchHi; // 19
    PXSize PXMIPSRegisterContextX; // 20
    PXSize PXMIPSRegisterUnusedB; // 21
    PXSize PXMIPSRegisterUnusedC; // 22
    PXSize PXMIPSRegisterUnusedD; // 23
    PXSize PXMIPSRegisterUnusedE; // 24
    PXSize PXMIPSRegisterUnusedF; // 25
    PXSize PXMIPSRegisterParityError; // 26
    PXSize PXMIPSRegisterCacheError; // 27
    PXSize PXMIPSRegisterTagLo; // 28
    PXSize PXMIPSRegisterTagHi; // 29
    PXSize PXMIPSRegisterErrorEPC; // 30
    PXSize PXMIPSRegisterUnusedG; // 31
}
PXMIPSRegister;

typedef void (PXAPI* PXMIPSTInstructionFunction)(struct PXMIPSProcessor_ PXREF pxMIPSProcessor, struct PXMIPSTInstruction_ PXREF pxMIPSTInstruction);


typedef struct PXMIPSCoProcessor_
{

    PXSize RegisterList[32];
    PXBool Enabled;
}
PXMIPSCoProcessor;

typedef struct PXMIPSProcessor_
{
    PXMIPSTInstructionFunction* GeneralInstructionList;
    PXMIPSTInstructionFunction* SpecialInstructionList;
    PXMIPSTInstructionFunction* REGIMMInstructionList;
    PXMIPSTInstructionFunction* CorpocessorList;

    void* ROMOffsetVirtual;
    void* ROMOffsetActual;
    PXSize ROMOffsetCurrent;
    PXSize ROMOffsetMaximal;

    void* RAMAdressVirtual;
    void* RAMAdress;
    PXSize RAMSize;

    void* ProgramCounter;
    PXSize RegisterStatus;

    PXF32 RegisterPXF32[32];

    union
    {
        PXSize RegisterList[32]; // GPRs general purpose registers (should be 32)
        PXMIPSRegister Register;
    };

